{
    "nieuws":
    [
        {
            "titel": "LES 1 - inleiding Advanced Front End Coding",
            "id": 1,
            "datum": "18 september 2017, 10u30",
            "categorieen": ["LES","INFO","OPDRACHT"],
            "samenvatting": "Een korte inleiding in het vak, de komende module en waar we ons de komende 6 weken mee gaan bezighouden.",
            "body": "<p>De eerste schooldag van het nieuwe schooljaar was meteen ook de dag waarop we voor de eerst keer ons keuzevak kregen. Na een korte terugblik op de voorbij twee jaar zijn we wat dieper gegaan op wat we tijdens dit keuze vak 'Advanced Front End Coding' allemaal zullen behandelen. Zoals de naam het zelf zegt gaat het hier om advanced coding, dit wil niet zeggen dat je reeds advanced moet zijn in coding of veel kennis en ervaring hebben. Het wil zeggen dat we dit jaar dieper ingaan op dingen die we de voorbij twee jaar slechts hebben aangehaald. Zo gaan we bijvoorbeeld dieper in op de MEAN (MongoDB, Express, AngularJS, Node.js) stack en verdiepen ons in de MERN (MongoDB, Express, React, Node.js) stack.</p><br><br><p>Als eerste opdracht moeten we een blog maken waarin we elke week een kijk geven in Advanced Front End Coding en waar we ons mee bezig houden. Wat ik aangenaam vind is dat we volledige vrijheid krijgen op gebied van werken en opdrachten. Er zijn geen regels wat betrefd lay-out of look. Hierdoor word het werken aan deze opdrachten leuker en wil je er ook graag aan werken omdat je dit volledig in je eigen stijl kan doen.</p><br><br>",
            "afbeeldingl": "18sep.png",
            "afbeeldings": "18sep.png"
        },
        {
            "titel": "LES 2 - MongoDB",
            "id": 2,
            "datum": "25 september 2017, 10u30",
            "categorieen": [""],
            "samenvatting": "",
            "body": "<p></p>",
            "afbeeldingl": "25sep.png",
            "afbeeldings": "25sep.png"
        },
        {
            "titel": "LES 3",
            "id": 3,
            "datum": "2 oktober 2017, 10u30",
            "categorieen": [""],
            "samenvatting": "",
            "body": "<p></p>",
            "afbeeldingl": "2okt.png",
            "afbeeldings": "2okt.png"
        },
        {
            "titel": "LES 4",
            "id": 4,
            "datum": "9 oktober 2017, 10u30",
            "categorieen": [""],
            "samenvatting": "",
            "body": "<p></p>",
            "afbeeldingl": "9okt.png",
            "afbeeldings": "9okt.png"
        },
        {
            "titel": "LES 5",
            "id": 5,
            "datum": "16 oktober 2017, 10u30",
            "categorieen": [""],
            "samenvatting": "",
            "body": "<p></p>",
            "afbeeldingl": "16okt.png",
            "afbeeldings": "16okt.png"
        }
    ]
}
